{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"faq_with_tabs_bgXMUb":{"type":"faq-with-tabs","blocks":{"tab1_FAdL6U":{"type":"tab1","settings":{"heading":"What are Groovs?","textarea":"Groovs are fully-custom insoles made with personalized biometric data to optimize the interface between your feet and your shoes. Made with luxury materials for high-performance, Groovs are there for you on the court, in the office, or en route. Precision-crafted for the optimal footwear experience, Groovs maximize comfort, endurance, and support to alleviate pain, improve stability, and maximize your ability to be at your best, day in and day out."}},"tab1_wwQQxx":{"type":"tab1","settings":{"heading":"Why do my feet hurt and how can Groovs help?","textarea":"There are many reasons why your feet may hurt, though one of them is pretty universal: you wear shoes. Your feet didn’t evolve to be put in shoes. Perhaps the most dynamic part of your body, your feet are meant to move freely to feel and flex their way across diverse terrains. Wearing shoes helps protect your feet, but it comes at a cost: they force your feet into an unnaturally static position for hours, day after day. Instead of being dynamic, flexible, and powerful to spring you up, over, and forward, the arches in your feet are made to do the weight-bearing grunt-work of the arches in the coliseum. But they’re not equipped to do that, so they collapse, contort, and develop pressure points. This contortion causes discomfort as your feet are tasked with supporting your body in a way they weren’t built to do. This dynamic can be counteracted by optimizing the position the shoe forces the foot into, but every foot is unique, and so the solution requires personalization. Using high-precision scanning and proprietary AI, Groov produces fully-custom insoles made to augment your shoes to provide the optimal fit and positioning – like a hug for your foot – that keeps you feeling your best, step after step after step."}},"tab1_rfHkUV":{"type":"tab1","settings":{"heading":"How long does it take to get Groovs?","textarea":"As soon as you place your order, Groov’s systems go into overdrive to identify the perfect position for your specific feet. Once we’ve honed in on your perfect alignment, we get to work crafting your pairs, which are then checked to ensure quality and shipped to your door. All said, you can expect your Groovs to arrive within roughly 7 days from when you place your order…and as on-demand manufacturers of fully-custom products, we’re pretty proud of that fact!"}},"tab1_yBHhQB":{"type":"tab1","settings":{"heading":"I have a different question. How can I get in touch?","textarea":"Take a look through the other FAQ sections. If you don’t see the answer you’re looking for, feel free to email us <a href=\"mailto:me@groov.me\" title=\"mailto:me@groov.me\"><strong>here<\/strong><\/a>!"}},"tab2_hLYkkw":{"type":"tab2","settings":{"heading":"What makes Groovs different from over-the-counter insoles?","textarea":"There’s so much that makes us different, and it’s all in service of an game-changing insole unlike any you’ve experience before! For starters, Groovs are fully custom, whereas over-the-counter insoles are typically manufactured as one-size-fits-most or few-sizes-fit-all. Customization makes all the difference when it comes to foot support. If you were building a bridge, you’d need the support beams to be exactly right – too high and they disrupt function, too low and they don’t work, out of place and they impede. Unlike over-the-counter insoles that often provide cushion instead of true support, Groov meets you where you can be at your best, bringing cushion, support, flexibility, and responsiveness – all in one package.…not to mention that Groovs can be made to fit perfectly in any shoes of choosing, right out of the box!"}},"tab2_KrQbg4":{"type":"tab2","settings":{"heading":"What makes Groovs different from orthotics?","textarea":"We’ll answer this one without getting into the fact that Groovs provide bespoke fabrication at a fraction of the price, are delivered in a sliver of the time, and don’t require the hassle of navigating doctors appointments.Groov exists to bring the benefits of footwear personalization and cutting-edge podiatric biomechanics out from the medical system and into your shoes. The vast majority of adults experience foot pain; this isn’t a medical issue—it’s a footwear one! Made to optimize your experience on your feet, Groovs are not medicine, they’re footwear. Orthotics, on the other hand, are medical devices made to correct anatomical deformities or pathologies. While Groovs aren’t intended to fix medical conditions, they’re likely to help prevent them, and tend to help alleviate the symptoms of many structural issues (including flat feet, high arches, plantar fasciitis, and more). Former orthotics-wearers who have switched to Groovs tell us that they love how thin, light, and compatible with existing shoes their Groovs are. An algorithmically-optimized (and non-medical) approach to positioning imbues every pair of Groovs with the perfect balance of alignment and cushion, while avoiding the negative experiences reported by some wearers of orthotics that are aggressively corrective. Simply put, Groovs deliver the perfect shoe with no medical hassle."}},"tab2_gymDFq":{"type":"tab2","settings":{"heading":"How long do Groovs last?","textarea":"The lifespan of a pair of Groovs is measured in miles, not minutes. Said another way, how quickly your Groovs wear out is a function of how much (and how aggressively) you wear them, not how old they. Though they often last far longer, we typically recommend replacing your Groovs as often as you replace the shoes you keep them in. If you transfer a singular pair of Groovs between all your shoes (and therefore wear it whenever you’re wearing shoes), we generally recommend replacing your Groovs once a year. As our feet tend to change as we age, best practice is to replace a pair of Groovs with a new pair (using updated foot scans) every five years, regardless of wear. For younger people – particularly those still growing – new pairs should be produced from updated scans more frequently."}},"tab2_Ddx9qG":{"type":"tab2","settings":{"heading":"Will I feel the benefits immediately?","textarea":"The benefits from wearing Groovs – particularly improved support and stability – can be felt almost immediately. Expect the comfort you experience as you move to increase with every step, particularly early on, as your feet unlearn their habituated structural coping mechanisms and relax into proper position.On rare occasion, customers who are entirely new to insoles or inserts of any kind may find there is a breaking-in period as their feet get adapt to proper support and get used to relaxing in a way they never previously could. If you experience some discomfort during your first few days wearing Groovs, try starting with just an hour or two, then increase your wear over the course of a week. This is uncommon, however, and we’re pretty confident that you’ll love the way your Groovs feel the moment your feet first touch them."}},"tab2_Qe6WxE":{"type":"tab2","settings":{"heading":"How often should I wear my Groovs?","textarea":"In short: whenever you’re wearing shoes! There is no such thing as “wearing your Groovs too much.” You don’t have to take your Groovs off if you don’t want to (and we don’t blame you for not!)Order multiple pairs of shoe-specific Groovs to ensure that every pair of shoes you own is fully-equipped to provide next-level comfort and support with every step. Or, go with a general purpose pair and move your Groovs into whichever shoes match the moment. How you Groov is up to you!"}},"tab2_heN8GE":{"type":"tab2","settings":{"heading":"What is the value of Groovs being semi-rigid?","textarea":"Footwear can offer flexibility and footwear can offer support – you want both. The semi-rigid structure in every pair of Groovs provide support that lets your feet focus on moving you forward instead of holding themselves up. Think about walking or running on the beach: your feet tire far faster in soft sand than in hard sand because soft sand eliminates responsiveness and therefore requires the small, stabilizer muscles in the foot to engage desperately to retain functional structure in the absence of support. A bit of rigidity enables every pair of Groovs to provide the support needed to let your feet focus their energy on doing what you need them to. When combined moderate flexibility and a structural tendency to “bounce back” to its innate position, Groovs flex with your feet to support full range of motion and transfer energy from each step into the next, leaving you feel light and springy, yet strong and stable."}},"tab3_Vje7yV":{"type":"tab3","settings":{"heading":"Do I need Groovs?","textarea":"Like sleeping on a good mattress, standing on a surface that treats your feet right is a luxury we think everyone deserves to experience. While Groovs were initially available exclusively to elite athletes seeking competitive edge, they are designed to benefit anyone who wears shoes, and are particularly beneficial for anyone seeking relief from the discomfort associated with long hours standing, flat feet, high arches, plantar fasciitis, and more. But to restate the real answer: regardless of what you do or don’t need, we feel you deserve to get your Groov on."}},"tab3_pXbUnr":{"type":"tab3","settings":{"heading":"What kind of footwear does Groov work with?","textarea":"Groovs can be tailored to most shoes, from sneakers to flats and cleats to loafers. While our general-purpose fit works with most sneakers and leisure shoes, we recommend shoe-specific fit for other footwear choices, particularly those with pointed-toes or esoteric shapes. Unfortunately, Groov is not yet available for open-toed shoes like sandals or high-heeled shoes like stilettos. Shoes with a closed toe and mild heel (<1 inch) can typically be worn with Groovs without issue."}},"tab3_KUJi8w":{"type":"tab3","settings":{"heading":"Do Groovs help athletic performance?","textarea":"By maximizing comfort and support, minimizing fatigue, and mitigating injury, Groov helps you work harder for longer so that you can be at your best when you need it most. The hug-like fit Groovs provide maximize responsiveness by eliminating gaps between the foot and the shoe that typically zap power, reduce precision, and squander precious moments of reaction time. Not only that, but the high-performance semi-rigid interior of every pair catalyzes energy transfer for more explosiveness in launch and lift-off. In the moments that matter, Groov helps you execute in picture-perfect manner."}},"tab3_erPTfX":{"type":"tab3","settings":{"heading":"Are Groovs only for athletes?","textarea":"Groovs are for <strong>everyone<\/strong>: from people who want to increase the comfort of their day-to-day life to athletes seeking to improve their performance."}},"tab3_99wLz6":{"type":"tab3","settings":{"heading":"Can children benefit from Groovs?","textarea":"Yes! Groovs are made for people of all ages. The feet of children and young people are more dynamic and susceptible to change than those of adults, and therefore the benefits of proper foot support are significant."}},"tab3_RgBWdX":{"type":"tab3","settings":{"heading":"Do Groovs help with leg, hip, and\/or back pain?","textarea":"While Groovs are not a medical device, pain in the legs, hips, or back often stems from biomechanical imbalances and originate from the feet. By correcting biomechanical alignment from the ground-up and improving overall stability, Groov helps people from all walks of life reduce pain and strain in the lower extremities and back."}},"tab4_rVEpUG":{"type":"tab4","settings":{"heading":"What do I need to use the app for?","textarea":"Groov’s app shifts the molding process from a clinician’s office to a customer’s iOS device through Groov’s proprietary ShapeSense 3D scanning software. By enabling you to take a high-precision scan of your feet (and shoes) from a phone, it allows for you to order your fully-custom Groovs without having to leave the comfort of your own home.But it’s not just more convenient—it’s better. To identify a foot’s optimal position, we must understand the foot’s innate positional tendencies. Other systems don’t just lack the enabling power of Groov’s proprietary machine-learning optimization algorithms, but they fail to even capture the position the foot naturally gravitates to without the pressure of body-weight forcing distortion. Unlike common pressure scanning, foam molding, or heat-and-step foot-modeling approaches, the Groov app’s multi-modal approach to scanning produces advanced models of your feet in both weight-bearing and non-bearing positions, allowing for holistic insight into the dynamic nature of the foot—without which, true optimization cannot occur.  And it’s a one-stop-shop! From scanning to purchase, tracking, reorder, and everything in between, everything you need to get your Groov on is accessible at the touch of a button."}},"tab4_LNtW8w":{"type":"tab4","settings":{"heading":"How do I get the app?","textarea":"The app is free and can be downloaded in the AppStore or using <strong>this link.<\/strong>"}},"tab4_WcYhm3":{"type":"tab4","settings":{"heading":"Do I have to get the app?","textarea":"With Groov’s in-app ShapeSense scanning technology being the motor that powers the production of personalized pairs, all orders are placed through the app. While we recommend downloading the app on your phone and creating your own account for the most convenient experience, account-holders can create secondary profiles to enable scanning and purchase for those who either don’t have an iOS device or prefer not to download the app and create their own account."}},"tab4_pmmTr4":{"type":"tab4","settings":{"heading":"How do I know if I scanned my feet right?","textarea":"To ensure a proper scan, we have detailed step-by-step instructions on the app that include the placement of your foot relative to the camera, moving the camera to capture all of the nuances, monitoring the scan in the process, and more.  There are also Assisted and\/or Self Scanning tutorials on the app designed to guide you through the entire process in detail. "}},"tab4_Kwwnqe":{"type":"tab4","settings":{"heading":"What if I have problems with the app?","textarea":"In the app, you can find step-by-step instructions – including tutorial videos and written guidance – on how to properly scan your feet and place an order for your Groovs. There are two options for scanning, Self Scan and Assisted Scan, and we generally recommend the latter for ease of use. In case you’re still having trouble with the scanning process or need guidance or help, you can contact us at you@groov.me, and we will be happy to assist."}},"tab5_waJDEb":{"type":"tab5","settings":{"heading":"Are Groovs covered by insurance and\/or HSA\/FSA?","textarea":"Groov does not directly accept insurance, though you can use your HSA\/FSA plan to purchase a pair with pre-tax income."}},"tab5_RKjL9B":{"type":"tab5","settings":{"heading":"Where does Groov ship to?","textarea":"We offer free shipping to all of the 50 states within the U.S. We also ship internationally to the following countries: Belgium, Canada, Switzerland, Czechia, Germany, Denmark, Spain, Finland, France, United Kingdom, Hong Kong SAR, Ireland, Israel, Italy, Japan, South Korea, Malaysia, Netherlands, Norway, New Zealand, Poland, Portugal, Sweden, Singapore, UAE, Austria and Australia."}},"tab5_w3rD3V":{"type":"tab5","name":"Tab 5 block - International Shipments","settings":{"heading":"International Shipments","textarea":"We offer free shipping internationally to the following countries: Belgium, Canada, Switzerland, Czechia, Germany, Denmark, Spain, Finland, France, United Kingdom, Hong Kong SAR, Ireland, Israel, Italy, Japan, South Korea, Malaysia, Netherlands, Norway, New Zealand, Poland, Portugal, Sweden, Singapore, UAE, Austria and Australia."}},"tab5_3x3d8T":{"type":"tab5","settings":{"heading":"How can I track my order?","textarea":"Once your order has shipped, you will receive an email to the address on file with your tracking information. Additionally, you can check the app at any point to get status updates. If you did not receive tracking information or have further tracking-related questions, please contact us<strong> <\/strong><a href=\"mailto:me@groov.me\" title=\"mailto:me@groov.me\"><strong>here.<\/strong><\/a>"}},"tab5_mDcjaf":{"type":"tab5","settings":{"heading":"What is Groov’s return policy?","textarea":"At Groov, we believe customer satisfaction is our reason for existing.  If there is ever an issue with your order, we want to know—don’t hesitate to<strong> <\/strong><a href=\"mailto:me@groov.me\" title=\"mailto:me@groov.me\"><strong>get in touch<\/strong><\/a>.  Given the custom nature of the product, we assess issues on a case-by-case basis. While you generally should not expect a full refund for simply changing your mind, you can count on receiving an expedited replacement – <strong>on us <\/strong>– if anything goes wrong with the production or delivery of your pairs."}},"tab5_TVdTPR":{"type":"tab5","settings":{"heading":"Can I change or cancel my order after I’ve placed it?","textarea":"We get right to work as soon as your order is placed, so we cannot guarantee post-hoc order changes or cancellations. If you reach out to us, we will do our best to assist. Once production has begun to produce your fully-custom pair, cancellation inquiries will be addressed through our return and replacement channel.If you need to update shipping information, please email <a href=\"mailto:you@groov.me\"><span style=\"text-decoration:underline\">you@groov.me<\/span><\/a>  Once the package has been sent out for shipment, it is no longer in our possession and any rerouting requests should be addressed with the carrier directly."}},"tab6_KNmgkD":{"type":"tab6","settings":{"heading":"Does Groov partner with athletic teams or organizations?","textarea":"Yes, we do! We love bringing teams into the fold to help them get that competitive advantage that Groov offers. And we would love to chat further – contact us at <a href=\"mailto:we@groov.me\"><span style=\"text-decoration:underline\">we@groov.me<\/span><\/a>"}},"tab6_jFAadn":{"type":"tab6","settings":{"heading":"Does Groov work with shoe brands or footwear retailers?","textarea":"Yes! Groov does work with shoe brands and retailers to enable them to sell custom footwear to their customers—right out of the box! Please reach out <a href=\"mailto:we@groov.me\" title=\"mailto:we@groov.me\"><strong>here<\/strong><\/a> for more information."}},"tab6_kwVfTT":{"type":"tab6","settings":{"heading":"How do I get in touch about partnership inquiries?","textarea":"Thank you for your interest in Groov! We are open to a range of collaborations that help us get folks feeling great on their feet.  If you want to work together or have an idea or proposal,  you can email us at you@groov.me"}},"tab6_zDHVzT":{"type":"tab6","settings":{"heading":"For more information, you can contact us","textarea":"Customer support email: <a href=\"mailto:you@groov.me\" title=\"mailto:you@groov.me\">you@groov.me <\/a>Business inquiries email <a href=\"mailto:we@groov.me\" title=\"mailto:we@groov.me\">we@groov.me<\/a>"}}},"block_order":["tab1_FAdL6U","tab1_wwQQxx","tab1_rfHkUV","tab1_yBHhQB","tab2_hLYkkw","tab2_KrQbg4","tab2_gymDFq","tab2_Ddx9qG","tab2_Qe6WxE","tab2_heN8GE","tab3_Vje7yV","tab3_pXbUnr","tab3_KUJi8w","tab3_erPTfX","tab3_99wLz6","tab3_RgBWdX","tab4_rVEpUG","tab4_LNtW8w","tab4_WcYhm3","tab4_pmmTr4","tab4_Kwwnqe","tab5_waJDEb","tab5_RKjL9B","tab5_w3rD3V","tab5_3x3d8T","tab5_mDcjaf","tab5_TVdTPR","tab6_KNmgkD","tab6_jFAadn","tab6_kwVfTT","tab6_zDHVzT"],"settings":{"heading":"YOU HAVE QUESTIONS?","textarea":"WE HAVE\nANSWERS:","head1":"Top Questions","head2":"What are Groovs","head3":"Who Should Get Groovs?","head4":"How to get Groovs","head5":"Payments, Shipping, and Returns","head6":"Business Inquiries"}}},"order":["main","faq_with_tabs_bgXMUb"]}